tutorials/tubularReactorNonIsothermal/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "5761";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
27600
(
(0.188362 -1.23826e-13 -0.000132513)
(0.189615 8.41136e-13 -0.000317039)
(0.192001 -1.76644e-12 -0.000500361)
(0.195398 -3.62386e-12 -0.00066889)
(0.19973 2.75434e-13 -0.000818516)
(0.204862 7.33912e-12 -0.000944056)
(0.210647 -1.30231e-11 -0.00104346)
(0.216932 -1.17513e-11 -0.00111636)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.188224 0 0);
    }
    wall01
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
30
(
(0.62899 6.56281e-11 7.0535e-07)
(0.627738 1.87421e-10 1.8321e-06)
(0.624984 3.14268e-10 2.90392e-06)
(0.6208 4.45117e-10 4.01881e-06)
(0.615197 5.77202e-10 5.09445e-06)
(0.608182 5.70904e-10 6.12399e-06)
(0.599757 5.81292e-10 7.09675e-06)
(0.589924 7.53521e-10 8.00191e-06)
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
