tutorials/tubularReactorNonIsothermal/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5761";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
27600
(
97013.4
97013.4
97013.4
97013.4
97013.4
97013.4
97013.4
97013.4
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    wall01
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 97000;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
