tutorials/tubularReactorNonIsothermal/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5761";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
27600
(
453.154
453.158
453.163
453.171
453.182
453.197
453.216
453.24
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 453.153;
    }
    wall01
    {
        type            fixedProfile;
        profile         csvFile;
        profileCoeffs
        {
            nHeaderLine     0;
            refColumn       0;
            componentColumns List<label> 1(1);
            separator       ",";
            mergeSeparators 0;
            file            "T_820.csv";
        }
        direction       (1 0 0);
        origin          0;
        value           nonuniform List<scalar> 
920
(
453.904
455.405
456.907
458.408
459.91
461.412
462.913
464.415
...
)
;
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 744.22;
        value           nonuniform List<scalar> 
30
(
759.567
759.531
759.453
759.335
759.176
758.979
758.743
758.47
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
