tutorials/tubularReactorNonIsothermal/0/mix:alpha
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5761";
    object      mix:alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
27600
(
4.56962e-05
4.56969e-05
4.56978e-05
4.56992e-05
4.57011e-05
4.57038e-05
4.57071e-05
4.57113e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
4.5696e-05
4.5696e-05
4.5696e-05
4.5696e-05
4.5696e-05
4.5696e-05
4.5696e-05
4.5696e-05
...
)
;
    }
    wall01
    {
        type            calculated;
        value           nonuniform List<scalar> 
920
(
4.58273e-05
4.60905e-05
4.63541e-05
4.66183e-05
4.68831e-05
4.71484e-05
4.74143e-05
4.76807e-05
...
)
;
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.000110994
0.000110985
0.000110966
0.000110937
0.000110898
0.00011085
0.000110792
0.000110725
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
