tutorials/tubularReactorNonIsothermal/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5761";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
27600
(
1.02476
1.02475
1.02474
1.02472
1.02469
1.02466
1.02462
1.02456
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1.02476;
    }
    wall01
    {
        type            calculated;
        value           nonuniform List<scalar> 
920
(
1.02307
1.01969
1.01634
1.01301
1.0097
1.00642
1.00315
0.999909
...
)
;
    }
    axis
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.609137
0.609165
0.609228
0.609323
0.60945
0.609608
0.609798
0.610018
...
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
